Revit 2027 API
InternalDefinitions Class
This object blocks attempts to create new internal definitions as they are not permitted.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definitions
 Autodesk.Revit.DB.InternalDefinitions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InternalDefinitions : Definitions
Public Class InternalDefinitions
	Inherits Definitions
public ref class InternalDefinitions : public Definitions
type InternalDefinitions =
    class
        inherit Definitions
    end
The InternalDefinitions type exposes the following members.
Properties
Name | Description
IsEmpty | Identifies if the definitions collection is empty.
(Inherited from Definitions)
Item | Retrieves a definition by a given name.
(Inherited from Definitions)
Size | The number of definitions in the collection.
(Inherited from Definitions)
Top
Methods
Name | Description
Contains | Tests for the existence of a definition within the set.
(Inherited from Definitions)
Create | Creates a new parameter definition using specified options.
(Inherited from Definitions)
Dispose
(Inherited from Definitions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
(Inherited from Definitions)
GetEnumerator | Retrieves an enumerator to the collection.
(Inherited from Definitions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace